Repository: trans-dam/TicTic-solution-classe
Catalog: code/tictic/lib/l10n/app_*.arb
Languages: fr

# appTitle
source: Application TicTic (en)
fr: Application TicTic

source: Continue without login
fr: Continuer sans compte

source: or
fr: ou

source: Login
fr: Connexion

source: Register
fr: Inscription

# username_label
source: Username
fr: Nom d'utilisateur

# user_password_label
source: Password
fr: Mot de passe

# already_have_account
source: Already have an account?
fr: Vous avez déjà un compte ?

# dont_have_account
source: Don't have an account?
fr: Vous n'avez pas de compte ?

# wrong_password
source: Wrong password provided for that user
fr: Mot de passe incorrect pour cet utilisateur.

# invalid_email
source: This email is invalid
fr: Cette adresse e-mail est invalide.

# user_disabled
source: Your account has been disabled
fr: Votre compte a été désactivé.

# user_not_found
source: This user does not exist
fr: Cet utilisateur n’existe pas.

# email_already_in_use
source: This email is already in use
fr: Cette adresse e-mail est déjà utilisée.

# operation_not_allowed
source: This operation is not allowed
fr: Cette opération n’est pas autorisée.

# account_exists_with_different_credential
source: Wrong password provided for that user
fr: Un compte existe déjà avec des identifiants différents.

# invalid_credential
source: Your account credential is not valid
fr: Les identifiants de votre compte ne sont pas valides.

# weak_password
source: Your password must be at least {nb} characters
fr: Votre mot de passe doit contenir au moins {nb} caractères.

# form_field_required
source: The field "{field_name}"is required.
fr: Le champ "{field_name}" est requis.

# text_slide_1
source: Financial harmony in your groups, made simple!
fr: L’harmonie financière dans vos groupes, en toute simplicité !

# text_slide_2
source: Instant calculations, fairness guaranteed with TicTic!
fr: Calculs instantanés, équité garantie avec TicTic !

# text_slide_3
source: Tedious math? No thanks. Choose simplicity with TicTic!
fr: Calculs fastidieux ? Non merci. Optez pour la simplicité avec TicTic !

# text_slide_4
source: TicTic: Share your expenses effortlessly!
fr: TicTic : Vos dépenses partagées en toute simplicité !
